export default [
  {
    // 正式服完整日志
    version: '2.3.1_雾海寻龙',
    date: '2024-04-25 09:00:00',
    content: [
      '【雾海寻龙】正式服完整更新日志',
      '技改相关',
      <p key='2.3.1_雾海寻龙_技改' style={{ paddingLeft: 12, marginBottom: 8 }}>
        <p>【上弦星流术】套路招式【劲风簇】伤害降低5%。 </p>
        <p>【上弦星流术】套路招式【霖集簇】伤害增加10%。</p>
        <p>【上弦星流术】套路招式【饮羽簇】伤害降低5%。 </p>
        <p>【贯穿】伤害降低10%。</p>
        <p>【偕行动物】伤害提高5%。</p>
        <p>【长右】“偕行动物”对目标造成伤害时回复15%内力。</p>
        <p>【长右】“偕行动物”对目标造成伤害时回复15%内力。</p>
        <p>【丛云隐月】重做</p>
        <p>具体技改看官网</p>
      </p>,
      '新赛季数值相关',
      <p key='2.3.1_雾海寻龙_数值' style={{ paddingLeft: 12, marginBottom: 8 }}>
        <p>装备库、小吃小药数值更新</p>
        <p>蓬莱阵(13%基础攻击)、凌雪阵(覆盖率)数值更新</p>
      </p>,
      '其余更新功能:',
      <p key='2.3.1_雾海寻龙_其他功能' style={{ paddingLeft: 12 }}>
        <p>【代码重构】使用新代码框架重构了模拟器</p>
        <p>【新循环】根据模拟器重新生成了循环</p>
        <p>【多方案系统】可以在保存装备、循环、增益信息至方案。快捷切换对比</p>
        <p>
          【配装器内面板显示】配装器内增加了当前装备的面板显示，同时展示和原装备对比属性变化情况
        </p>
        <p>【快速设置附魔】根据当前增益/循环等信息快速配置最佳附魔</p>
        <p>【快速设置五彩石】根据当前增益/循环等信息快速配置最佳五彩石</p>
        <p>【团队增益显示优化】为兼容后续更多的增益，优化了团队增益显示。修改增益移动到弹窗内。</p>
        <p>
          【橙武循环】当配装包含大橙武时，选择系统默认循环会自动切换为内置橙武循环，选择自定义循环则不会。
        </p>
      </p>,
    ],
  },
  {
    version: '2.2.6_体服',
    date: '2024-04-22 10:30:00',
    content: [
      <p key='2.2.6_1'>新增新赛季装备库（暂定，按照惯例正式服还会变一次）</p>,
      <p key='2.2.6_2'>新增属性“全能”，1点全能等于1点破招+1点无双+1点化劲</p>,
      <p key='2.2.6_3'>大附魔、小药等数据还没拿到新版本的值，没有更新</p>,
    ],
  },
  {
    version: '2.2.5_体服',
    date: '2024-04-19 10:30:00',
    content: [
      <p key='2.2.5_3'>模拟器-【丛云隐月】增加被动，饮羽簇CD降低一秒，主动开启降低三秒（暂定）</p>,
    ],
  },
  {
    version: '2.2.4_体服',
    date: '2024-04-17 10:30:00',
    content: [
      <p key='2.2.4_1'>修改蓬莱阵第二重增益为：基础攻击提高【15%】</p>,
      <p key='2.2.4_2'>修改凌雪阵第五重覆盖率为：55%</p>,
      <p key='2.2.4_3'>
        模拟器-【丛云隐月】增加被动，饮羽簇CD降低一秒，主动开启额外降低一秒（暂定）
      </p>,
    ],
  },
  {
    version: '2.2.3_体服',
    date: '2024-04-11 17:30:00',
    content: [
      <p key='2.2.3_1'>模拟器-修复没石饮羽的作用间隔帧数，6帧不吃加速</p>,
      <p key='2.2.3_2'>模拟器-修改宠物大象入场时间，为16+20帧</p>,
      <p key='2.2.3_3'>模拟器-新增显示标鹄层数功能，仅显示该技能释放时的层数</p>,
      <p key='2.2.3_4'>上述模拟器改动的影响已更新至计算循环</p>,
      <p key='2.2.3_5'>变更内置循环为三压和考古</p>,
    ],
  },
  {
    version: '2.2.2_体服',
    date: '2024-04-07 14:00:00',
    content: [
      <p key='2.2.2_1'>新增了悟切换开关，暂无循环和技能系数</p>,
      <p key='2.2.2_2'>为兼容后续更多增益，优化了团队增益显示。修改增益移动到弹窗内。</p>,
      <p key='2.2.2_3'>大量代码逻辑优化</p>,
    ],
  },
  {
    version: '2.2.1_体服',
    date: '2024-04-03 11:00:00',
    content: [
      <p key='2.2.1_1'>
        体肤更新三改
        <a href='https://jx3.xoyo.com/announce/gg.html?id=1333643' target='_blank' rel='noreferrer'>
          技改链接
        </a>
      </p>,
      <p key='2.2.1_2' style={{ paddingLeft: 12 }}>
        {`- 模拟器新增【丛云隐月】`}
      </p>,
    ],
  },
  {
    version: '2.2.1_体服',
    date: '2024-03-27 19:10:00',
    content: [
      '更新了多方案系统，可以在保存装备、循环、增益信息至方案。快捷切换对比',
      '配装器内增加了当前装备的面板显示，同时展示和原装备对比属性变化情况',
    ],
  },
  {
    version: '2.2.0_体服',
    date: '2024-03-19 13:00:00',
    content: [
      '体服二改',
      <p key='2.2.0_体服' style={{ paddingLeft: 12 }}>
        - 于狩触发条件修改为3-5箭
      </p>,
      '重点更新事项',
      <p key='2.2.0_模拟器' style={{ paddingLeft: 12 }}>
        - 使用新的结构重新编写了计算器
        <a href='https://www.jx3box.com/tool/75292' target='_blank' rel='noreferrer'>
          使用手册参考刀宗
        </a>
      </p>,
      <p key='2.2.0_移除延迟' style={{ paddingLeft: 12 }}>
        - 模拟器还处于调试阶段，有使用问题欢迎反馈
      </p>,
      'CW玩家请注意:',
      <p key='3.0.0_CW提醒' style={{ paddingLeft: 12 }}>
        <p>- 目前只有在选择朝仪万汇_孰湖时才会内置CW循环</p>
        <p>- 内置循环是一个基本打不出的完美情况，满大招5特效</p>
        <p>- 其他需求的循环请在模拟器内自行设定和保存</p>
      </p>,
    ],
  },
  {
    version: '2.1.0_体服',
    date: '2024-03-04 20:40:00',
    content: [
      <p key='2.1.0_1'>
        体肤更新一改：
        <a
          href='https://jx3.xoyo.com/index/#/article-details?catid=2458&id=6120'
          target='_blank'
          rel='noreferrer'
        >
          技改链接
        </a>
      </p>,
      <p key='2.1.0_2' style={{ paddingLeft: 12 }}>
        {`- 【劲风簇】伤害降低5%`}
      </p>,
      <p key='2.1.0_3' style={{ paddingLeft: 12 }}>
        {`- 【饮羽簇】伤害降低5%`}
      </p>,
      <p key='2.1.0_4' style={{ paddingLeft: 12 }}>
        {`- 【贯穿】伤害降低10%`}
      </p>,
      <p key='2.1.0_5' style={{ paddingLeft: 12 }}>
        {`- 【霖集簇】伤害提高10%`}
      </p>,
      <p key='2.1.0_6' style={{ paddingLeft: 12 }}>
        {`- 【偕行动物】伤害提高5%`}
      </p>,
      <p key='2.1.0_6' style={{ paddingLeft: 12 }}>
        {`- 【九乌】=> 所有宠物攻击均可上两层贯穿`}
      </p>,
      <p key='2.1.0_6' style={{ paddingLeft: 12 }}>
        {`- 【引风唤灵】调息时间【21】=>【23】`}
      </p>,
      <p key='2.1.0_4' style={{ paddingLeft: 12, color: 'red' }}>
        {'技改总结：'}
      </p>,
      <p key='2.1.0_4' style={{ paddingLeft: 12, color: 'red' }}>
        {`- dps削弱4%-5%`}
      </p>,
      <p key='2.1.0_4' style={{ paddingLeft: 12, color: 'red' }}>
        {'体服版本只会在国外源计算器更新'}
      </p>,
    ],
  },
  {
    version: '2.0.11',
    date: '2024-02-26 09:00:00',
    content: [
      '2月26日技改：',
      '【饮羽簇】伤害降低10%',
      '【劲风簇】伤害降低10%',
      '【贯穿】伤害降低10%',
      'dps削弱5-7%',
    ],
  },
  {
    version: '2.0.10',
    date: '2024-01-29 16:30:00',
    content: [
      '问卷收集完成，删掉了问卷弹窗',
      '循环模拟(beta)功能更新:',
      '新增了手动添加寒更晓箭的按钮',
    ],
  },
  {
    version: '2.0.9',
    date: '2024-01-15 11:20:00',
    content: ['更新小CW'],
  },
  {
    version: '2.0.8',
    date: '2024-01-11 09:00:00',
    content: ['1月11日技改', '【饮羽簇】伤害降低5%', '【标鹄】伤害降低5%', '总dps降低约不到2%'],
  },
  {
    version: '2.0.7',
    date: '2023-12-28 14:10:00',
    content: ['新增装备龙门飞剑武器（剑风数量乱写的）'],
  },
  {
    version: '2.0.6',
    date: '2023-12-22 10:00:00',
    content: ['新增装备冬至武器、腰带、衣服、戒指。选择2件以上触发套装效果'],
  },
  {
    version: '2.0.5',
    date: '2023-12-20 17:00:00',
    content: [
      '避免部分萌新错判一键宏朱厌的强度，把循环选择内朱厌循环分成了两个',
      '朱厌（一键宏）：魔盒上搜了一个，找的清城的宏录了个循环',
      '朱厌（压缩）：原压缩循环',
    ],
  },
  {
    version: '2.0.4',
    date: '2023-12-18 17:10:00',
    content: [
      '更新了一批家园创意料理',
      '应问卷反馈，更新了一批蓝色小药。方便对比增加了颜色区分',
      '开启增益智能对比后可看到不包含加速在内的各小药间dps差距（请注意开启后有性能损耗）',
    ],
  },
  {
    version: '2.0.3',
    date: '2023-12-14 09:30:00',
    content: ['暂时隐藏诸怀循环', '更新CW桑柘循环的技能数据'],
  },
  {
    version: '2.0.2',
    date: '2023-12-13 15:30:00',
    content: [
      '更新万灵两个阵眼的覆盖率。取压缩循环的朱厌和大招循环，朱厌为87%，大招为66%',
      '内置的朱厌循环第二层奇穴默认改为孰湖',
    ],
  },
  {
    version: '2.0.1',
    date: '2023-12-11 22:30:00',
    content: ['更新了内置的桑柘循环', '循环模拟(beta)功能更新:', '修改了引爆贯穿逻辑'],
  },
  {
    version: '2.0.0',
    date: '2023-12-11 09:42:00',
    content: [
      '新增非侠8%',
      '【饮羽簇】伤害降低10%',
      '【劲风簇】伤害降低10%',
      '【标鹄】伤害降低10%',
      '【贯穿】伤害降低10%',
      '循环模拟(beta)功能更新:',
      '修改了棘矢和于狩的引爆贯穿逻辑',
      '根据循环模拟器推导的循环',
    ],
  },
  {
    version: '1.2.0',
    date: '2023-12-08 11:10:00',
    content: ['循环模拟(beta)功能更新:', '增加了唤灵印相关逻辑的日志'],
  },
  {
    version: '1.1.9',
    date: '2023-12-07 17:30:00',
    content: ['更新增益劲风破风的数值为1397（奇穴描述是33%实际并不是）'],
  },
  {
    version: '1.1.8',
    date: '2023-12-06 10:00:00',
    content: [
      '暂时隐藏星烨循环',
      '细化了阵眼显示，将朱厌和大招两个流派的阵眼覆盖单独显示。',
      '新增保存模拟循环为自定义循环功能，可以在外部循环选择直接使用。',
      '考虑占用浏览器存储问题，目前最多保存一个自定义循环',
    ],
  },
  {
    version: '1.1.7',
    date: '2023-12-01 12:50:00',
    content: [
      '循环模拟(beta)功能更新:',
      '新增了技能CD显示',
      '该功能还在持续开发和debug中，请勿以该功能作为直接结论和结论依赖。需结合自身实践。',
    ],
  },
  {
    version: '1.1.6',
    date: '2023-11-29 10:30:00',
    content: [
      '循环模拟(beta)功能更新:',
      '优化了循环编辑的交互',
      '添加了满层承契起手的选项',
      '添加了是否实时计算的选项，避免性能损耗',
      '该功能还在持续开发和debug中，请勿以该功能作为直接结论和结论依赖。需结合自身实践。',
    ],
  },
  {
    version: '1.1.5',
    date: '2023-11-28 15:45:00',
    content: [
      '循环模拟(beta)功能更新:',
      '增加如何使用引导',
      '修正使同时触发引爆贯穿和上贯穿时先触发引爆。',
      '删除内置网络延迟和加速功能，引用外部设置好数据',
      '该功能还在持续开发和debug中，请勿以该功能作为直接结论和结论依赖。需结合自身实践。',
    ],
  },
  {
    version: '1.1.4',
    content: ['循环模拟(beta)功能更新，开放自定义循环功能。更多功能敬请期待'],
  },
  {
    version: '1.1.3',
    content: ['新增循环模拟(beta)功能，目前循环写死，下周会开放自定义循环功能'],
  },
  {
    version: '1.1.2',
    content: [
      '优化Dps核心算法类，dps计算效率提升约20%',
      '新增配装器内智能对比功能，开启后选择装备动态展示dps差异。',
      '优化收益图表显示，以第一项作为100%基准对比，仅优化显示不影响原收益高低关系',
    ],
  },
  {
    version: '1.1.1',
    content: ['增加了起手选项，可以选择是否为5层承契起手'],
  },
  {
    version: '1.1.0',
    content: ['修改门派套装双会buff的覆盖率为70%', '修正部分技能基础伤害系数', '部分系数计算优化'],
  },
  {
    version: '1.0.9',
    content: [
      '增加了快捷切换常用增益的选项，方便增益进行一键设置。部分增益层数是问群友的，如有出入请留言订正',
      '重构了dps计算部分的代码，dps结果不影响，仅增强代码可读性，方便代码review。',
    ],
  },
  {
    version: '1.0.8',
    content: ['更新阵眼计算无双相关的计算错误。感谢霸刀考拉大佬的捉虫'],
  },
  {
    version: '1.0.7',
    content: [
      '朱厌循环可以切换九乌。卢令奇穴。贯穿质量存在差异，计算时间统一为[3分02秒箭打完]',
      '增加了阵眼收益动态显示，基于当前属性动态计算，按从高到底排序',
    ],
  },
  {
    version: '1.0.6',
    content: [
      '更新了优化后朝仪万汇-桑柘(非CW)循环的技能数量【计算时间3分04秒】，循环来自风雪入我怀',
      '更新了优化后朱厌循环技能数量【计算时间3分04秒】',
    ],
  },
  {
    version: '1.0.5',
    content: [
      '更新了朝仪万汇-诸怀CW循环的技能数量',
      '更新了基于清城优化后的朱厌循环技能数量',
      '11月6日技改，饮羽系数-10%，饮羽添加新秘籍（15非侠）',
      '技改总结：单饮加强了1.1 ~ 1.4%。结合饮的实际占比，总dps变化不到1%',
    ],
  },
  {
    version: '1.0.4',
    content: [
      '新增了朝仪万汇套路下两个循环的CW循环，选择CW和朝仪万汇套路时会自动触发',
      '新增了装备10800橙武',
    ],
  },
  {
    version: '1.0.3',
    content: [
      '因为诸怀循环会比桑拓循环更快的叠满承契。精细了各循环承契的实际覆盖率使各循环计算更加合理',
      '拆分了大招流桑拓和诸怀循环',
      '限制了饮羽只能选择一个伤害秘籍',
      '计算前请重新选择循环',
      'CW只有数值没有做CW循环！！',
    ],
  },
  {
    version: '1.0.2',
    content: ['更新循环，变更为朱厌、星烨、朝仪万汇。计算前请手动重新选择奇穴'],
  },
  {
    version: '1.0.1',
    content: ['更新小CW落梨雪'],
  },
  {
    version: '1.0.0',
    content: ['万灵正式版', '暂无CW循环'],
  },
  {
    version: '0.0.1',
    content: ['体服版本，千变万化，代码还有很多问题，先看一乐。循环、系数待定。'],
  },
]
