export default [
  {
    version: '2.0.6',
    date: '2023-12-22 10:00:00',
    content: ['新增装备冬至武器、腰带、衣服、戒指。选择2件以上触发套装效果'],
  },
  {
    version: '2.0.5',
    date: '2023-12-20 17:00:00',
    content: [
      '避免部分萌新错判一键宏朱厌的强度，把循环选择内朱厌循环分成了两个',
      '朱厌（一键宏）：魔盒上搜了一个，找的清城的宏录了个循环',
      '朱厌（压缩）：原压缩循环',
    ],
  },
  {
    version: '2.0.4',
    date: '2023-12-18 17:10:00',
    content: [
      '更新了一批家园创意料理',
      '应问卷反馈，更新了一批蓝色小药。方便对比增加了颜色区分',
      '开启增益智能对比后可看到不包含加速在内的各小药间dps差距（请注意开启后有性能损耗）',
    ],
  },
  {
    version: '2.0.3',
    date: '2023-12-14 09:30:00',
    content: ['暂时隐藏诸怀循环', '更新CW桑柘循环的技能数据'],
  },
  {
    version: '2.0.2',
    date: '2023-12-13 15:30:00',
    content: [
      '更新万灵两个阵眼的覆盖率。取压缩循环的朱厌和大招循环，朱厌为87%，大招为66%',
      '内置的朱厌循环第二层奇穴默认改为孰湖',
    ],
  },
  {
    version: '2.0.1',
    date: '2023-12-11 22:30:00',
    content: ['更新了内置的桑柘循环', '循环模拟(beta)功能更新:', '修改了引爆贯穿逻辑'],
  },
  {
    version: '2.0.0',
    date: '2023-12-11 09:42:00',
    content: [
      '新增非侠8%',
      '【饮羽簇】伤害降低10%',
      '【劲风簇】伤害降低10%',
      '【标鹄】伤害降低10%',
      '【贯穿】伤害降低10%',
      '循环模拟(beta)功能更新:',
      '修改了棘矢和于狩的引爆贯穿逻辑',
      '根据循环模拟器推导的循环',
    ],
  },
  {
    version: '1.2.0',
    date: '2023-12-08 11:10:00',
    content: ['循环模拟(beta)功能更新:', '增加了唤灵印相关逻辑的日志'],
  },
  {
    version: '1.1.9',
    date: '2023-12-07 17:30:00',
    content: ['更新增益劲风破风的数值为1397（奇穴描述是33%实际并不是）'],
  },
  {
    version: '1.1.8',
    date: '2023-12-06 10:00:00',
    content: [
      '暂时隐藏星烨循环',
      '细化了阵眼显示，将朱厌和大招两个流派的阵眼覆盖单独显示。',
      '新增保存模拟循环为自定义循环功能，可以在外部循环选择直接使用。',
      '考虑占用浏览器存储问题，目前最多保存一个自定义循环',
    ],
  },
  {
    version: '1.1.7',
    date: '2023-12-01 12:50:00',
    content: [
      '循环模拟(beta)功能更新:',
      '新增了技能CD显示',
      '该功能还在持续开发和debug中，请勿以该功能作为直接结论和结论依赖。需结合自身实践。',
    ],
  },
  {
    version: '1.1.6',
    date: '2023-11-29 10:30:00',
    content: [
      '循环模拟(beta)功能更新:',
      '优化了循环编辑的交互',
      '添加了满层承契起手的选项',
      '添加了是否实时计算的选项，避免性能损耗',
      '该功能还在持续开发和debug中，请勿以该功能作为直接结论和结论依赖。需结合自身实践。',
    ],
  },
  {
    version: '1.1.5',
    date: '2023-11-28 15:45:00',
    content: [
      '循环模拟(beta)功能更新:',
      '增加如何使用引导',
      '修正使同时触发引爆贯穿和上贯穿时先触发引爆。',
      '删除内置网络延迟和加速功能，引用外部设置好数据',
      '该功能还在持续开发和debug中，请勿以该功能作为直接结论和结论依赖。需结合自身实践。',
    ],
  },
  {
    version: '1.1.4',
    content: ['循环模拟(beta)功能更新，开放自定义循环功能。更多功能敬请期待'],
  },
  {
    version: '1.1.3',
    content: ['新增循环模拟(beta)功能，目前循环写死，下周会开放自定义循环功能'],
  },
  {
    version: '1.1.2',
    content: [
      '优化Dps核心算法类，dps计算效率提升约20%',
      '新增配装器内智能对比功能，开启后选择装备动态展示dps差异。',
      '优化收益图表显示，以第一项作为100%基准对比，仅优化显示不影响原收益高低关系',
    ],
  },
  {
    version: '1.1.1',
    content: ['增加了起手选项，可以选择是否为5层承契起手'],
  },
  {
    version: '1.1.0',
    content: ['修改门派套装双会buff的覆盖率为70%', '修正部分技能基础伤害系数', '部分系数计算优化'],
  },
  {
    version: '1.0.9',
    content: [
      '增加了快捷切换常用增益的选项，方便增益进行一键设置。部分增益层数是问群友的，如有出入请留言订正',
      '重构了dps计算部分的代码，dps结果不影响，仅增强代码可读性，方便代码review。',
    ],
  },
  {
    version: '1.0.8',
    content: ['更新阵眼计算无双相关的计算错误。感谢霸刀考拉大佬的捉虫'],
  },
  {
    version: '1.0.7',
    content: [
      '朱厌循环可以切换九乌。卢令奇穴。贯穿质量存在差异，计算时间统一为[3分02秒箭打完]',
      '增加了阵眼收益动态显示，基于当前属性动态计算，按从高到底排序',
    ],
  },
  {
    version: '1.0.6',
    content: [
      '更新了优化后朝仪万汇-桑柘(非CW)循环的技能数量【计算时间3分04秒】，循环来自风雪入我怀',
      '更新了优化后朱厌循环技能数量【计算时间3分04秒】',
    ],
  },
  {
    version: '1.0.5',
    content: [
      '更新了朝仪万汇-诸怀CW循环的技能数量',
      '更新了基于清城优化后的朱厌循环技能数量',
      '11月6日技改，饮羽系数-10%，饮羽添加新秘籍（15非侠）',
      '技改总结：单饮加强了1.1 ~ 1.4%。结合饮的实际占比，总dps变化不到1%',
    ],
  },
  {
    version: '1.0.4',
    content: [
      '新增了朝仪万汇套路下两个循环的CW循环，选择CW和朝仪万汇套路时会自动触发',
      '新增了装备10800橙武',
    ],
  },
  {
    version: '1.0.3',
    content: [
      '因为诸怀循环会比桑拓循环更快的叠满承契。精细了各循环承契的实际覆盖率使各循环计算更加合理',
      '拆分了大招流桑拓和诸怀循环',
      '限制了饮羽只能选择一个伤害秘籍',
      '计算前请重新选择循环',
      'CW只有数值没有做CW循环！！',
    ],
  },
  {
    version: '1.0.2',
    content: ['更新循环，变更为朱厌、星烨、朝仪万汇。计算前请手动重新选择奇穴'],
  },
  {
    version: '1.0.1',
    content: ['更新小CW落梨雪'],
  },
  {
    version: '1.0.0',
    content: ['万灵正式版', '暂无CW循环'],
  },
  {
    version: '0.0.1',
    content: ['体服版本，千变万化，代码还有很多问题，先看一乐。循环、系数待定。'],
  },
]
