export default [
  {
    version: '1.0.4',
    content: [
      '新增了朝仪万汇套路下两个循环的CW循环，选择CW和朝仪万汇套路时会自动触发',
      '新增了装备10800橙武',
    ],
  },
  {
    version: '1.0.3',
    content: [
      '因为诸怀循环会比桑拓循环更快的叠满承契。精细了各循环承契的实际覆盖率使各循环计算更加合理',
      '拆分了大招流桑拓和诸怀循环',
      '限制了饮羽只能选择一个伤害秘籍',
      '计算前请重新选择循环',
      'CW只有数值没有做CW循环！！',
    ],
  },
  {
    version: '1.0.2',
    content: ['更新循环，变更为朱厌、星烨、朝仪万汇。计算前请手动重新选择奇穴'],
  },
  {
    version: '1.0.1',
    content: ['更新小CW落梨雪'],
  },
  {
    version: '1.0.0',
    content: ['万灵正式版', '暂无CW循环'],
  },
  {
    version: '0.0.1',
    content: ['体服版本，千变万化，代码还有很多问题，先看一乐。循环、系数待定。'],
  },
]
