// 循环模拟所需要常量
export const 总箭数 = 8

// 测试基础循环
export const 测试循环 = [
  // 起手
  ['饮羽簇-读条', '没石饮羽', '引风唤灵', '弛律召野', '朝仪万汇', '劲风簇', '弛风鸣角'],
  ['劲风簇', '劲风簇', '饮羽簇', '没石饮羽', '劲风簇', '劲风簇'],
  ['劲风簇', '劲风簇', '饮羽簇', '没石饮羽', '劲风簇', '劲风簇'],
  ['劲风簇', '劲风簇', '饮羽簇', '没石饮羽', '劲风簇', '劲风簇'],
  ['劲风簇', '劲风簇', '引风唤灵', '饮羽簇', '没石饮羽', '劲风簇', '朝仪万汇', '劲风簇'],
  // 正常循环-1
  ['弛风鸣角', '饮羽簇', '没石饮羽', '引风唤灵', '劲风簇'],
  ['劲风簇', '劲风簇', '饮羽簇', '没石饮羽', '劲风簇', '劲风簇'],
  ['劲风簇', '劲风簇', '饮羽簇', '没石饮羽', '劲风簇', '劲风簇'],
  ['劲风簇', '劲风簇', '引风唤灵', '饮羽簇', '没石饮羽', '劲风簇', '朝仪万汇', '劲风簇'],
  // 正常循环-2
  ['弛风鸣角', '饮羽簇', '没石饮羽', '引风唤灵', '劲风簇'],
  ['劲风簇', '劲风簇', '饮羽簇', '没石饮羽', '劲风簇', '劲风簇'],
  ['劲风簇', '劲风簇', '饮羽簇', '没石饮羽', '劲风簇', '劲风簇'],
  ['劲风簇', '劲风簇', '引风唤灵', '饮羽簇', '没石饮羽', '劲风簇', '朝仪万汇', '劲风簇'],
  // 正常循环-3
  ['弛风鸣角', '饮羽簇', '没石饮羽', '引风唤灵', '劲风簇'],
  ['劲风簇', '劲风簇', '饮羽簇', '没石饮羽', '劲风簇', '劲风簇'],
  ['劲风簇', '劲风簇', '饮羽簇', '没石饮羽', '劲风簇', '劲风簇'],
  ['劲风簇', '劲风簇', '引风唤灵', '饮羽簇', '没石饮羽', '劲风簇', '朝仪万汇', '劲风簇'],
]

export const 测试宠物顺序 = ['虎', '鹰', '猪', '象', '熊', '狼']
