import { CycleDTO } from '../../@types/cycle'

const cycle: CycleDTO[] = [
  {
    技能名称: '饮雨簇',
    技能数量: 52,
  },
  {
    技能名称: '劲风簇',
    技能数量: 104,
  },
  {
    技能名称: '破',
    技能数量: 120,
  },
  {
    技能名称: '贯穿(DOT)·六',
    技能数量: 50,
  },
  {
    技能名称: '贯穿(DOT)·五',
    技能数量: 50,
  },
  {
    技能名称: '贯穿(DOT)·四',
    技能数量: 50,
  },
  {
    技能名称: '贯穿(DOT)·三',
    技能数量: 50,
  },
  {
    技能名称: '贯穿(DOT)·二',
    技能数量: 50,
  },
  {
    技能名称: '贯穿(DOT)·一',
    技能数量: 50,
  },
  {
    技能名称: '风矢',
    技能数量: 111,
  },
  {
    技能名称: '攻击',
    技能数量: 11,
  },
  {
    技能名称: '践踏',
    技能数量: 2,
  },
  {
    技能名称: '流血·四',
    技能数量: 39,
  },
]

export default cycle
