import { CycleDTO } from '../../@types/cycle'

const cycle: CycleDTO[] = [
  {
    技能名称: '标鹄',
    技能数量: 1,
  },
  {
    技能名称: '朝仪万汇',
    技能数量: 1,
  },
  {
    技能名称: '贯穿·1',
    统计用技能名称: '贯穿_一层_承契_0',
    技能数量: 1,
  },
  {
    技能名称: '贯穿·1',
    统计用技能名称: '贯穿_一层_承契_1',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '承契_1层', 增益技能数: 1 }],
  },
  {
    技能名称: '贯穿·1',
    统计用技能名称: '贯穿_一层_承契_2',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '承契_2层', 增益技能数: 1 }],
  },
  {
    技能名称: '贯穿·1',
    统计用技能名称: '贯穿_一层_承契_3',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '承契_3层', 增益技能数: 1 }],
  },
  {
    技能名称: '贯穿·1',
    统计用技能名称: '贯穿_一层_承契_4',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '承契_4层', 增益技能数: 1 }],
  },
  {
    技能名称: '贯穿·1',
    统计用技能名称: '贯穿_一层_承契_5',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 1 }],
  },
  {
    技能名称: '贯穿·2',
    统计用技能名称: '贯穿_二层_承契_0',
    技能数量: 1,
  },
  {
    技能名称: '贯穿·2',
    统计用技能名称: '贯穿_二层_承契_1',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '承契_1层', 增益技能数: 1 }],
  },
  {
    技能名称: '贯穿·2',
    统计用技能名称: '贯穿_二层_承契_2',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '承契_2层', 增益技能数: 1 }],
  },
  {
    技能名称: '贯穿·2',
    统计用技能名称: '贯穿_二层_承契_3',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '承契_3层', 增益技能数: 1 }],
  },
  {
    技能名称: '贯穿·2',
    统计用技能名称: '贯穿_二层_承契_4',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '承契_4层', 增益技能数: 1 }],
  },
  {
    技能名称: '贯穿·2',
    统计用技能名称: '贯穿_二层_承契_5',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 1 }],
  },
  {
    技能名称: '贯穿·3',
    统计用技能名称: '贯穿_三层_承契_1',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '承契_1层', 增益技能数: 1 }],
  },
  {
    技能名称: '贯穿·3',
    统计用技能名称: '贯穿_三层_承契_0',
    技能数量: 1,
  },
  {
    技能名称: '贯穿·3',
    统计用技能名称: '贯穿_三层_承契_2',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '承契_2层', 增益技能数: 1 }],
  },
  {
    技能名称: '贯穿·3',
    统计用技能名称: '贯穿_三层_承契_3',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '承契_3层', 增益技能数: 1 }],
  },
  {
    技能名称: '贯穿·3',
    统计用技能名称: '贯穿_三层_承契_4',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '承契_4层', 增益技能数: 1 }],
  },
  {
    技能名称: '贯穿·3',
    统计用技能名称: '贯穿_三层_承契_5',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 1 }],
  },
  {
    技能名称: '贯穿·4',
    统计用技能名称: '贯穿_四层_承契_0',
    技能数量: 1,
  },
  {
    技能名称: '贯穿·4',
    统计用技能名称: '贯穿_四层_承契_1',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '承契_1层', 增益技能数: 1 }],
  },
  {
    技能名称: '贯穿·4',
    统计用技能名称: '贯穿_四层_承契_2',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '承契_2层', 增益技能数: 1 }],
  },
  {
    技能名称: '贯穿·4',
    统计用技能名称: '贯穿_四层_承契_3',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '承契_3层', 增益技能数: 1 }],
  },
  {
    技能名称: '贯穿·4',
    统计用技能名称: '贯穿_四层_承契_4',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '承契_4层', 增益技能数: 1 }],
  },
  {
    技能名称: '贯穿·4',
    统计用技能名称: '贯穿_四层_承契_5',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 1 }],
  },
  {
    技能名称: '贯穿·5',
    统计用技能名称: '贯穿_五层_承契_0',
    技能数量: 1,
  },
  {
    技能名称: '贯穿·5',
    统计用技能名称: '贯穿_五层_承契_1',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '承契_1层', 增益技能数: 1 }],
  },
  {
    技能名称: '贯穿·5',
    统计用技能名称: '贯穿_五层_承契_2',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '承契_2层', 增益技能数: 1 }],
  },
  {
    技能名称: '贯穿·5',
    统计用技能名称: '贯穿_五层_承契_3',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '承契_3层', 增益技能数: 1 }],
  },
  {
    技能名称: '贯穿·5',
    统计用技能名称: '贯穿_五层_承契_4',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '承契_4层', 增益技能数: 1 }],
  },
  {
    技能名称: '贯穿·5',
    统计用技能名称: '贯穿_五层_承契_5',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 1 }],
  },
  {
    技能名称: '贯穿·6',
    统计用技能名称: '贯穿_六层_承契_0',
    技能数量: 1,
  },
  {
    技能名称: '贯穿·6',
    统计用技能名称: '贯穿_六层_承契_1',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '承契_1层', 增益技能数: 1 }],
  },
  {
    技能名称: '贯穿·6',
    统计用技能名称: '贯穿_六层_承契_2',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '承契_2层', 增益技能数: 1 }],
  },
  {
    技能名称: '贯穿·6',
    统计用技能名称: '贯穿_六层_承契_3',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '承契_3层', 增益技能数: 1 }],
  },
  {
    技能名称: '贯穿·6',
    统计用技能名称: '贯穿_六层_承契_4',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '承契_4层', 增益技能数: 1 }],
  },
  {
    技能名称: '贯穿·6',
    统计用技能名称: '贯穿_六层_承契_5',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 1 }],
  },
  {
    技能名称: '贯穿·6·引爆',
    统计用技能名称: '贯穿_六层_引爆_承契_5',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 1 }],
  },
  {
    技能名称: '风矢',
    技能数量: 1,
  },
]

export default cycle

// 默认奇穴
export const 循环默认奇穴 = [
  '素矰',
  '棘矢',
  '襄尺',
  '长右',
  '鹿蜀',
  '诸怀',
  '于狩',
  '九乌',
  '托月',
  '佩弦',
  '审固',
  '朱厌',
]
