import { CycleDTO } from '../../@types/cycle'

const cycle: CycleDTO[] = [
  {
    技能名称: '饮雨簇',
    技能数量: 53,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 53 }],
  },
  {
    技能名称: '劲风簇',
    技能数量: 115,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 115 }],
  },
  {
    技能名称: '破',
    技能数量: 112,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 112 }],
  },
  {
    技能名称: '贯穿(DOT)·六·引爆',
    技能数量: 21,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 21 }],
  },
  {
    技能名称: '贯穿(DOT)·六',
    技能数量: 262,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 262 }],
  },
  {
    技能名称: '贯穿(DOT)·五',
    技能数量: 14,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 14 }],
  },
  {
    技能名称: '贯穿(DOT)·四',
    技能数量: 9,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 9 }],
  },
  {
    技能名称: '贯穿(DOT)·三',
    技能数量: 28,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 28 }],
  },
  {
    技能名称: '贯穿(DOT)·二',
    技能数量: 8,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 8 }],
  },
  {
    技能名称: '贯穿(DOT)·一',
    技能数量: 8,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 8 }],
  },
  {
    技能名称: '风矢',
    技能数量: 114,
    技能增益列表: [
      { 增益名称: '承契_3层', 增益技能数: 3 },
      { 增益名称: '承契_5层', 增益技能数: 111 },
    ],
  },
  {
    技能名称: '攻击-虎',
    技能数量: 3,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 3 }],
  },
  {
    技能名称: '攻击-狼',
    技能数量: 6,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 6 }],
  },
  {
    技能名称: '攻击-鹰',
    技能数量: 2,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 2 }],
  },
  {
    技能名称: '攻击-野猪',
    技能数量: 3,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 3 }],
  },
  {
    技能名称: '攻击-熊',
    技能数量: 3,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 3 }],
  },
  {
    技能名称: '践踏',
    技能数量: 3,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 3 }],
  },
]

export default cycle

export const 循环默认奇穴 = [
  '素矰',
  '棘矢',
  '襄尺',
  '长右',
  '鹿蜀',
  '诸怀',
  '于狩',
  '九乌',
  '陆吾',
  '佩弦',
  '审固',
  '朱厌',
]
