import { CycleDTO } from '../../@types/cycle'

const cycle: CycleDTO[] = [
  {
    技能名称: '标鹄',
    技能数量: 41,
    技能增益列表: [
      { 增益名称: '承契_3层', 增益技能数: 1 },
      { 增益名称: '承契_4层', 增益技能数: 2 },
      { 增益名称: '承契_5层', 增益技能数: 38 },
    ],
  },
  {
    技能名称: '饮羽簇',
    技能数量: 80,
    技能增益列表: [
      { 增益名称: '承契_1层', 增益技能数: 3 },
      { 增益名称: '承契_4层', 增益技能数: 1 },
      { 增益名称: '承契_5层', 增益技能数: 76 },
    ],
  },
  {
    技能名称: '劲风簇',
    技能数量: 80,
    技能增益列表: [
      { 增益名称: '承契_3层', 增益技能数: 1 },
      { 增益名称: '承契_4层', 增益技能数: 10 },
      { 增益名称: '承契_5层', 增益技能数: 56 },
      { 增益名称: '承契_5层,星烨', 增益技能数: 23 },
    ],
  },
  {
    技能名称: '破',
    技能数量: 165,
    技能增益列表: [
      { 增益名称: '承契_1层', 增益技能数: 3 },
      { 增益名称: '承契_3层', 增益技能数: 1 },
      { 增益名称: '承契_4层', 增益技能数: 11 },
      { 增益名称: '承契_5层', 增益技能数: 150 },
    ],
  },
  {
    技能名称: '贯穿·十八',
    技能数量: 21,
    技能增益列表: [
      { 增益名称: '承契_2层', 增益技能数: 1 },
      { 增益名称: '承契_4层', 增益技能数: 1 },
      { 增益名称: '承契_5层', 增益技能数: 19 },
    ],
  },
  {
    技能名称: '贯穿·六',
    技能数量: 273,
    技能增益列表: [
      { 增益名称: '承契_2层', 增益技能数: 13 },
      { 增益名称: '承契_4层', 增益技能数: 13 },
      { 增益名称: '承契_5层', 增益技能数: 247 },
    ],
  },
  {
    技能名称: '贯穿·五',
    技能数量: 18,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 18 }],
  },
  {
    技能名称: '贯穿·四',
    技能数量: 29,
    技能增益列表: [
      { 增益名称: '承契_2层', 增益技能数: 1 },
      { 增益名称: '承契_4层', 增益技能数: 4 },
      { 增益名称: '承契_5层', 增益技能数: 24 },
    ],
  },
  {
    技能名称: '贯穿·三',
    技能数量: 9,
    技能增益列表: [
      { 增益名称: '承契_4层', 增益技能数: 2 },
      { 增益名称: '承契_5层', 增益技能数: 7 },
    ],
  },
  {
    技能名称: '贯穿·二',
    技能数量: 2,
    技能增益列表: [
      { 增益名称: '承契_2层', 增益技能数: 1 },
      { 增益名称: '承契_3层', 增益技能数: 1 },
    ],
  },
  {
    技能名称: '贯穿·一',
    技能数量: 2,
    技能增益列表: [{ 增益名称: '承契_1层', 增益技能数: 2 }],
  },
  {
    技能名称: '风矢',
    技能数量: 121,
    技能增益列表: [
      { 增益名称: '承契_1层', 增益技能数: 2 },
      { 增益名称: '承契_2层', 增益技能数: 1 },
      { 增益名称: '承契_5层', 增益技能数: 118 },
    ],
  },
  {
    技能名称: '攻击-虎',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 1 }],
  },
  {
    技能名称: '攻击-狼',
    技能数量: 3,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 3 }],
  },
  {
    技能名称: '攻击-鹰',
    技能数量: 3,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 3 }],
  },
  {
    技能名称: '重击',
    技能数量: 2,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 2 }],
  },
  {
    技能名称: '践踏',
    技能数量: 2,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 2 }],
  },
]

export default cycle

export const 循环默认奇穴 = [
  '素矰',
  '棘矢',
  '襄尺',
  '长右',
  '鹿蜀',
  '诸怀',
  '于狩',
  '卢令',
  '托月',
  '佩弦',
  '审固',
  '星烨',
]
