import { CycleDTO } from '@/@types/cycle'

const cycle: CycleDTO[] = [
  {
    技能名称: '标鹄',
    技能数量: 78,
    技能增益列表: [{ 增益名称: '承契_5层,贯侯', 增益技能数: 78 }],
  },
  {
    技能名称: '饮羽簇',
    技能数量: 92,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 92 }],
  },
  {
    技能名称: '月弦激星',
    技能数量: 28,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 28 }],
  },
  {
    技能名称: '劲风簇',
    技能数量: 57,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 57 }],
  },
  {
    技能名称: '破',
    技能数量: 146,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 146 }],
  },
  {
    技能名称: '朝仪万汇',
    技能数量: 88,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 88 }],
  },
  {
    技能名称: '贯穿·18',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 1 }],
  },
  {
    技能名称: '贯穿·15',
    技能数量: 6,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 6 }],
  },
  { 技能名称: '贯穿·12', 技能数量: 13, 技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 13 }] },
  {
    技能名称: '贯穿·9',
    技能数量: 3,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 3 }],
  },
  {
    技能名称: '贯穿·8',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 1 }],
  },
  {
    技能名称: '贯穿·6',
    技能数量: 287,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 287 }],
  },
  {
    技能名称: '贯穿·5',
    技能数量: 35,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 35 }],
  },
  {
    技能名称: '贯穿·4',
    技能数量: 12,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 12 }],
  },
  {
    技能名称: '贯穿·3',
    技能数量: 8,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 8 }],
  },
  {
    技能名称: '贯穿·2',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 1 }],
  },
  {
    技能名称: '贯穿·1',
    技能数量: 2,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 2 }],
  },
  {
    技能名称: '风矢',
    技能数量: 96,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 96 }],
  },
  {
    技能名称: '攻击-虎',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 1 }],
  },
  {
    技能名称: '攻击-狼',
    技能数量: 3,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 3 }],
  },
  {
    技能名称: '攻击-鹰',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 1 }],
  },
  {
    技能名称: '重击',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 1 }],
  },
  {
    技能名称: '践踏',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 1 }],
  },
  {
    技能名称: '劲风簇·神兵',
    技能数量: 18,
    技能增益列表: [{ 增益名称: '劲风簇·神兵', 增益技能数: 18 }],
  },
]

export default cycle

export const 循环默认奇穴 = [
  '素矰',
  '棘矢', // '棘矢',
  '襄尺',
  '长右',
  '鹿蜀',
  // '诸怀', // '桑柘',
  '桑柘',
  '于狩',
  '卢令',
  '托月',
  '佩弦',
  '贯侯',
  '朝仪万汇',
]
