import { CycleDTO } from '../../@types/cycle'

const cycle: CycleDTO[] = [
  {
    技能名称: '标鹄',
    技能数量: 74,
    技能增益列表: [
      { 增益名称: '承契_4层,贯侯', 增益技能数: 1 },
      { 增益名称: '承契_5层,贯侯', 增益技能数: 73 },
    ],
  },
  {
    技能名称: '饮羽簇',
    技能数量: 94,
    技能增益列表: [
      { 增益名称: '承契_1层', 增益技能数: 3 },
      { 增益名称: '承契_5层', 增益技能数: 91 },
    ],
  },
  {
    技能名称: '月弦激星',
    技能数量: 28,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 28 }],
  },
  {
    技能名称: '劲风簇',
    技能数量: 63,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 63 }],
  },
  {
    技能名称: '破',
    技能数量: 145,
    技能增益列表: [
      { 增益名称: '承契_1层', 增益技能数: 3 },
      { 增益名称: '承契_5层', 增益技能数: 141 },
    ],
  },
  {
    技能名称: '朝仪万汇',
    技能数量: 78,
    技能增益列表: [
      { 增益名称: '承契_4层', 增益技能数: 1 },
      { 增益名称: '承契_5层', 增益技能数: 78 },
    ],
  },
  {
    技能名称: '贯穿·六',
    技能数量: 240,
    技能增益列表: [
      { 增益名称: '承契_4层', 增益技能数: 3 },
      { 增益名称: '承契_5层', 增益技能数: 237 },
    ],
  },
  {
    技能名称: '贯穿·五',
    技能数量: 11,
    技能增益列表: [
      { 增益名称: '承契_2层', 增益技能数: 1 },
      { 增益名称: '承契_5层', 增益技能数: 10 },
    ],
  },
  {
    技能名称: '贯穿·四',
    技能数量: 33,
    技能增益列表: [
      { 增益名称: '承契_1层', 增益技能数: 3 },
      { 增益名称: '承契_2层', 增益技能数: 1 },
      { 增益名称: '承契_5层', 增益技能数: 29 },
    ],
  },
  {
    技能名称: '贯穿·三',
    技能数量: 12,
    技能增益列表: [
      { 增益名称: '承契_1层', 增益技能数: 1 },
      { 增益名称: '承契_5层', 增益技能数: 11 },
    ],
  },
  {
    技能名称: '贯穿·二',
    技能数量: 8,
    技能增益列表: [
      { 增益名称: '承契_1层', 增益技能数: 1 },
      { 增益名称: '承契_5层', 增益技能数: 7 },
    ],
  },
  {
    技能名称: '贯穿·一',
    技能数量: 6,
    技能增益列表: [
      { 增益名称: '承契_1层', 增益技能数: 2 },
      { 增益名称: '承契_5层', 增益技能数: 4 },
    ],
  },
  {
    技能名称: '风矢',
    技能数量: 100,
    技能增益列表: [
      { 增益名称: '承契_1层', 增益技能数: 2 },
      { 增益名称: '承契_2层', 增益技能数: 1 },
      { 增益名称: '承契_5层', 增益技能数: 87 },
    ],
  },
  {
    技能名称: '攻击-虎',
    技能数量: 2,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 2 }],
  },
  {
    技能名称: '攻击-狼',
    技能数量: 3,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 3 }],
  },
  {
    技能名称: '攻击-鹰',
    技能数量: 3,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 3 }],
  },
  {
    技能名称: '重击',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 1 }],
  },
  {
    技能名称: '践踏',
    技能数量: 2,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 2 }],
  },
]

export default cycle

export const 循环默认奇穴 = [
  '素矰',
  '棘矢', // '棘矢',
  '襄尺',
  '长右',
  '鹿蜀',
  // '诸怀', // '桑柘',
  '桑柘',
  '于狩',
  '卢令',
  '托月',
  '佩弦',
  '贯侯',
  '朝仪万汇',
]
