import { CycleDTO } from '@/@types/cycle'

const cycle: CycleDTO[] = [
  {
    技能名称: '破',
    技能数量: 136,
    技能增益列表: [
      {
        增益名称: '承契_1层',
        增益技能数: 3,
      },
      {
        增益名称: '承契_2层',
        增益技能数: 8,
      },
      {
        增益名称: '承契_3层',
        增益技能数: 4,
      },
      {
        增益名称: '承契_4层',
        增益技能数: 4,
      },
      {
        增益名称: '承契_5层',
        增益技能数: 116,
      },
    ],
  },
  {
    技能名称: '饮羽簇',
    技能数量: 68,
    技能增益列表: [
      {
        增益名称: '承契_1层',
        增益技能数: 3,
      },
      {
        增益名称: '承契_2层',
        增益技能数: 1,
      },
      {
        增益名称: '承契_3层',
        增益技能数: 3,
      },
      {
        增益名称: '承契_4层',
        增益技能数: 1,
      },
      {
        增益名称: '承契_5层',
        增益技能数: 59,
      },
    ],
  },
  {
    技能名称: '风矢',
    技能数量: 89,
    技能增益列表: [
      {
        增益名称: '承契_1层',
        增益技能数: 2,
      },
      {
        增益名称: '承契_2层',
        增益技能数: 5,
      },
      {
        增益名称: '承契_3层',
        增益技能数: 3,
      },
      {
        增益名称: '承契_4层',
        增益技能数: 2,
      },
      {
        增益名称: '承契_5层',
        增益技能数: 77,
      },
    ],
  },
  {
    技能名称: '贯穿·1',
    技能数量: 20,
    技能增益列表: [
      {
        增益名称: '承契_1层',
        增益技能数: 2,
      },
      {
        增益名称: '承契_2层',
        增益技能数: 4,
      },
      {
        增益名称: '承契_5层',
        增益技能数: 14,
      },
    ],
  },
  {
    技能名称: '贯穿·2',
    技能数量: 5,
    技能增益列表: [
      {
        增益名称: '承契_1层',
        增益技能数: 1,
      },
      {
        增益名称: '承契_3层',
        增益技能数: 1,
      },
      {
        增益名称: '承契_5层',
        增益技能数: 3,
      },
    ],
  },
  {
    技能名称: '贯穿·4',
    技能数量: 9,
    技能增益列表: [
      {
        增益名称: '承契_1层',
        增益技能数: 3,
      },
      {
        增益名称: '承契_5层',
        增益技能数: 6,
      },
    ],
  },
  {
    技能名称: '攻击-狼',
    技能数量: 6,
    技能增益列表: [
      {
        增益名称: '承契_1层',
        增益技能数: 3,
      },
      {
        增益名称: '承契_5层',
        增益技能数: 3,
      },
    ],
  },
  {
    技能名称: '朝仪万汇',
    技能数量: 100,
    技能增益列表: [
      {
        增益名称: '承契_1层',
        增益技能数: 4,
      },
      {
        增益名称: '承契_2层',
        增益技能数: 16,
      },
      {
        增益名称: '承契_5层',
        增益技能数: 80,
      },
    ],
  },
  {
    技能名称: '标鹄',
    技能数量: 78,
    技能增益列表: [
      {
        增益名称: '承契_1层,贯侯',
        增益技能数: 2,
      },
      {
        增益名称: '承契_2层,贯侯',
        增益技能数: 8,
      },
      {
        增益名称: '承契_3层,贯侯',
        增益技能数: 1,
      },
      {
        增益名称: '承契_4层,贯侯',
        增益技能数: 1,
      },
      {
        增益名称: '承契_5层,贯侯',
        增益技能数: 66,
      },
    ],
  },
  {
    技能名称: '贯穿·6',
    技能数量: 268,
    技能增益列表: [
      {
        增益名称: '承契_1层',
        增益技能数: 3,
      },
      {
        增益名称: '承契_2层',
        增益技能数: 24,
      },
      {
        增益名称: '承契_3层',
        增益技能数: 7,
      },
      {
        增益名称: '承契_4层',
        增益技能数: 5,
      },
      {
        增益名称: '承契_5层',
        增益技能数: 229,
      },
    ],
  },
  {
    技能名称: '劲风簇',
    技能数量: 68,
    技能增益列表: [
      {
        增益名称: '承契_2层',
        增益技能数: 7,
      },
      {
        增益名称: '承契_3层',
        增益技能数: 1,
      },
      {
        增益名称: '承契_4层',
        增益技能数: 3,
      },
      {
        增益名称: '承契_5层',
        增益技能数: 57,
      },
    ],
  },
  {
    技能名称: '贯穿·18',
    技能数量: 7,
    技能增益列表: [
      {
        增益名称: '承契_2层',
        增益技能数: 1,
      },
      {
        增益名称: '承契_3层',
        增益技能数: 1,
      },
      {
        增益名称: '承契_5层',
        增益技能数: 5,
      },
    ],
  },
  {
    技能名称: '贯穿·5',
    技能数量: 25,
    技能增益列表: [
      {
        增益名称: '承契_2层',
        增益技能数: 1,
      },
      {
        增益名称: '承契_3层',
        增益技能数: 1,
      },
      {
        增益名称: '承契_4层',
        增益技能数: 2,
      },
      {
        增益名称: '承契_5层',
        增益技能数: 21,
      },
    ],
  },
  {
    技能名称: '贯穿·3',
    技能数量: 29,
    技能增益列表: [
      {
        增益名称: '承契_3层',
        增益技能数: 1,
      },
      {
        增益名称: '承契_5层',
        增益技能数: 28,
      },
    ],
  },
  {
    技能名称: '攻击-鹰',
    技能数量: 2,
    技能增益列表: [
      {
        增益名称: '承契_3层',
        增益技能数: 1,
      },
      {
        增益名称: '承契_5层',
        增益技能数: 1,
      },
    ],
  },
  {
    技能名称: '贯穿·9',
    技能数量: 5,
    技能增益列表: [
      {
        增益名称: '承契_5层',
        增益技能数: 5,
      },
    ],
  },
  {
    技能名称: '贯穿·12',
    技能数量: 10,
    技能增益列表: [
      {
        增益名称: '承契_5层',
        增益技能数: 10,
      },
    ],
  },
  {
    技能名称: '贯穿·15',
    技能数量: 10,
    技能增益列表: [
      {
        增益名称: '承契_5层',
        增益技能数: 10,
      },
    ],
  },
  {
    技能名称: '攻击-虎',
    技能数量: 2,
    技能增益列表: [
      {
        增益名称: '承契_5层',
        增益技能数: 2,
      },
    ],
  },
  {
    技能名称: '践踏',
    技能数量: 1,
    技能增益列表: [
      {
        增益名称: '承契_5层',
        增益技能数: 1,
      },
    ],
  },
  {
    技能名称: '重击',
    技能数量: 1,
    技能增益列表: [
      {
        增益名称: '承契_5层',
        增益技能数: 1,
      },
    ],
  },
  {
    技能名称: '攻击-熊',
    技能数量: 1,
    技能增益列表: [
      {
        增益名称: '承契_5层',
        增益技能数: 1,
      },
    ],
  },
]

export default cycle

export const 循环默认奇穴 = [
  '素矰',
  '棘矢', // '棘矢',
  '襄尺',
  '长右',
  '鹿蜀',
  // '诸怀', // '桑柘',
  '桑柘',
  '于狩',
  '卢令',
  '托月',
  '佩弦',
  '贯侯',
  '朝仪万汇',
]
