import { CycleDTO } from '../../@types/cycle'

const cycle: CycleDTO[] = [
  {
    技能名称: '标鹄',
    技能数量: 78,
    技能增益列表: [
      { 增益名称: '承契_4层,贯侯', 增益技能数: 1 },
      { 增益名称: '承契_5层,贯侯', 增益技能数: 77 },
    ],
  },
  {
    技能名称: '饮羽簇',
    技能数量: 72,
    技能增益列表: [
      { 增益名称: '承契_1层', 增益技能数: 3 },
      { 增益名称: '承契_5层', 增益技能数: 69 },
    ],
  },
  {
    技能名称: '劲风簇',
    技能数量: 64,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 64 }],
  },
  {
    技能名称: '破',
    技能数量: 135,
    技能增益列表: [
      { 增益名称: '承契_1层', 增益技能数: 3 },
      { 增益名称: '承契_5层', 增益技能数: 132 },
    ],
  },
  {
    技能名称: '朝仪万汇',
    技能数量: 100,
    技能增益列表: [
      { 增益名称: '承契_4层', 增益技能数: 1 },
      { 增益名称: '承契_5层', 增益技能数: 99 },
    ],
  },
  {
    技能名称: '贯穿·六',
    技能数量: 216,
    技能增益列表: [
      { 增益名称: '承契_4层', 增益技能数: 5 },
      { 增益名称: '承契_5层', 增益技能数: 211 },
    ],
  },
  {
    技能名称: '贯穿·五',
    技能数量: 28,
    技能增益列表: [
      { 增益名称: '承契_2层', 增益技能数: 1 },
      { 增益名称: '承契_5层', 增益技能数: 27 },
    ],
  },
  {
    技能名称: '贯穿·四',
    技能数量: 30,
    技能增益列表: [
      { 增益名称: '承契_1层', 增益技能数: 4 },
      { 增益名称: '承契_5层', 增益技能数: 26 },
    ],
  },
  {
    技能名称: '贯穿·三',
    技能数量: 15,
    技能增益列表: [
      { 增益名称: '承契_1层', 增益技能数: 1 },
      { 增益名称: '承契_5层', 增益技能数: 14 },
    ],
  },
  {
    技能名称: '贯穿·二',
    技能数量: 11,
    技能增益列表: [
      { 增益名称: '承契_1层', 增益技能数: 1 },
      { 增益名称: '承契_5层', 增益技能数: 10 },
    ],
  },
  {
    技能名称: '贯穿·一',
    技能数量: 5,
    技能增益列表: [
      { 增益名称: '承契_1层', 增益技能数: 2 },
      { 增益名称: '承契_5层', 增益技能数: 3 },
    ],
  },
  {
    技能名称: '风矢',
    技能数量: 91,
    技能增益列表: [
      { 增益名称: '承契_1层', 增益技能数: 2 },
      { 增益名称: '承契_2层', 增益技能数: 1 },
      { 增益名称: '承契_5层', 增益技能数: 88 },
    ],
  },
  {
    技能名称: '攻击-虎',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 1 }],
  },
  {
    技能名称: '攻击-狼',
    技能数量: 5,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 5 }],
  },
  {
    技能名称: '攻击-鹰',
    技能数量: 3,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 3 }],
  },
  {
    技能名称: '重击',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 1 }],
  },
  {
    技能名称: '践踏',
    技能数量: 2,
    技能增益列表: [{ 增益名称: '承契_5层', 增益技能数: 2 }],
  },
]

export default cycle

export const 循环默认奇穴 = [
  '素矰',
  '孰湖', // '棘矢',
  '襄尺',
  '长右',
  '鹿蜀',
  // '诸怀', // '桑柘',
  '诸怀',
  '于狩',
  '卢令',
  '托月',
  '佩弦',
  '贯侯',
  '朝仪万汇',
]
