import { CycleDTO } from '../../@types/cycle'

const cycle: CycleDTO[] = [
  {
    技能名称: '标鹄',
    技能数量: 52,
    技能增益列表: [{ 增益名称: '承契_5层,贯侯', 增益技能数: 52 }],
  },
  {
    技能名称: '饮雨簇',
    技能数量: 80,
    技能增益列表: [{ 增益名称: '承契_5层,', 增益技能数: 80 }],
  },
  {
    技能名称: '劲风簇',
    技能数量: 84,
    技能增益列表: [{ 增益名称: '承契_5层,', 增益技能数: 84 }],
  },
  {
    技能名称: '破',
    技能数量: 165,
    技能增益列表: [{ 增益名称: '承契_5层,', 增益技能数: 165 }],
  },
  {
    技能名称: '贯穿·十八',
    技能数量: 14,
    技能增益列表: [{ 增益名称: '承契_5层,', 增益技能数: 14 }],
  },
  {
    技能名称: '贯穿·六',
    技能数量: 277,
    技能增益列表: [{ 增益名称: '承契_5层,', 增益技能数: 251 }],
  },
  {
    技能名称: '贯穿·五',
    技能数量: 12,
    技能增益列表: [{ 增益名称: '承契_5层,', 增益技能数: 12 }],
  },
  {
    技能名称: '贯穿·四',
    技能数量: 12,
    技能增益列表: [{ 增益名称: '承契_5层,', 增益技能数: 12 }],
  },
  {
    技能名称: '贯穿·三',
    技能数量: 12,
    技能增益列表: [{ 增益名称: '承契_5层,', 增益技能数: 12 }],
  },
  {
    技能名称: '贯穿·二',
    技能数量: 12,
    技能增益列表: [{ 增益名称: '承契_5层,', 增益技能数: 12 }],
  },
  {
    技能名称: '贯穿·一',
    技能数量: 12,
    技能增益列表: [{ 增益名称: '承契_5层,', 增益技能数: 12 }],
  },
  {
    技能名称: '风矢',
    技能数量: 121,
    技能增益列表: [{ 增益名称: '承契_5层,', 增益技能数: 121 }],
  },
  {
    技能名称: '攻击-虎',
    技能数量: 2,
    技能增益列表: [{ 增益名称: '承契_5层,', 增益技能数: 2 }],
  },
  {
    技能名称: '攻击-狼',
    技能数量: 10,
    技能增益列表: [{ 增益名称: '承契_5层,', 增益技能数: 10 }],
  },
  {
    技能名称: '攻击-鹰',
    技能数量: 3,
    技能增益列表: [{ 增益名称: '承契_5层,', 增益技能数: 3 }],
  },
  {
    技能名称: '重击',
    技能数量: 3,
    技能增益列表: [{ 增益名称: '承契_5层,', 增益技能数: 3 }],
  },
  {
    技能名称: '践踏',
    技能数量: 2,
    技能增益列表: [{ 增益名称: '承契_5层,', 增益技能数: 2 }],
  },
]

export default cycle

export const 循环默认奇穴 = [
  '素矰',
  '棘矢',
  '襄尺',
  '长右',
  '鹿蜀',
  // '诸怀', // '桑柘',
  '桑柘',
  '于狩',
  '卢令',
  '托月',
  '佩弦',
  '贯侯',
  '朱厌',
]
