import { CycleDTO } from '../../@types/cycle'

const cycle: CycleDTO[] = [
  {
    技能名称: '破',
    技能数量: 184,
    技能增益列表: [
      {
        增益名称: '承契_1层',
        增益技能数: 4,
      },
      {
        增益名称: '承契_2层',
        增益技能数: 1,
      },
      {
        增益名称: '承契_3层',
        增益技能数: 2,
      },
      {
        增益名称: '承契_5层',
        增益技能数: 176,
      },
    ],
  },
  {
    技能名称: '饮羽簇',
    技能数量: 92,
    技能增益列表: [
      {
        增益名称: '承契_1层',
        增益技能数: 3,
      },
      {
        增益名称: '承契_5层',
        增益技能数: 88,
      },
    ],
  },
  {
    技能名称: '风矢',
    技能数量: 120,
    技能增益列表: [
      {
        增益名称: '承契_1层',
        增益技能数: 4,
      },
      {
        增益名称: '承契_4层',
        增益技能数: 1,
      },
      {
        增益名称: '承契_5层',
        增益技能数: 115,
      },
    ],
  },
  {
    技能名称: '贯穿·1',
    技能数量: 14,
    技能增益列表: [
      {
        增益名称: '承契_1层',
        增益技能数: 2,
      },
      {
        增益名称: '承契_5层',
        增益技能数: 12,
      },
    ],
  },
  {
    技能名称: '贯穿·2',
    技能数量: 7,
    技能增益列表: [
      {
        增益名称: '承契_1层',
        增益技能数: 1,
      },
      {
        增益名称: '承契_5层',
        增益技能数: 6,
      },
    ],
  },
  {
    技能名称: '贯穿·4',
    技能数量: 13,
    技能增益列表: [
      {
        增益名称: '承契_1层',
        增益技能数: 5,
      },
      {
        增益名称: '承契_5层',
        增益技能数: 8,
      },
    ],
  },
  {
    技能名称: '攻击-虎',
    技能数量: 3,
    技能增益列表: [
      {
        增益名称: '承契_1层',
        增益技能数: 1,
      },
      {
        增益名称: '承契_5层',
        增益技能数: 2,
      },
    ],
  },
  {
    技能名称: '攻击-鹰',
    技能数量: 3,
    技能增益列表: [
      {
        增益名称: '承契_1层',
        增益技能数: 1,
      },
      {
        增益名称: '承契_5层',
        增益技能数: 2,
      },
    ],
  },
  {
    技能名称: '重击',
    技能数量: 3,
    技能增益列表: [
      {
        增益名称: '承契_1层',
        增益技能数: 1,
      },
      {
        增益名称: '承契_5层',
        增益技能数: 2,
      },
    ],
  },
  {
    技能名称: '践踏',
    技能数量: 3,
    技能增益列表: [
      {
        增益名称: '承契_1层',
        增益技能数: 1,
      },
      {
        增益名称: '承契_5层',
        增益技能数: 2,
      },
    ],
  },
  {
    技能名称: '标鹄',
    技能数量: 60,
    技能增益列表: [
      {
        增益名称: '承契_1层,贯侯',
        增益技能数: 1,
      },
      {
        增益名称: '承契_3层,贯侯',
        增益技能数: 1,
      },
      {
        增益名称: '承契_5层,贯侯',
        增益技能数: 58,
      },
    ],
  },
  {
    技能名称: '劲风簇',
    技能数量: 92,
    技能增益列表: [
      {
        增益名称: '承契_1层',
        增益技能数: 1,
      },
      {
        增益名称: '承契_2层',
        增益技能数: 1,
      },
      {
        增益名称: '承契_3层',
        增益技能数: 2,
      },
      {
        增益名称: '承契_5层',
        增益技能数: 88,
      },
    ],
  },
  {
    技能名称: '贯穿·6',
    技能数量: 281,
    技能增益列表: [
      {
        增益名称: '承契_1层',
        增益技能数: 2,
      },
      {
        增益名称: '承契_2层',
        增益技能数: 1,
      },
      {
        增益名称: '承契_3层',
        增益技能数: 2,
      },
      {
        增益名称: '承契_4层',
        增益技能数: 2,
      },
      {
        增益名称: '承契_5层',
        增益技能数: 274,
      },
    ],
  },
  {
    技能名称: '贯穿·18',
    技能数量: 9,
    技能增益列表: [
      {
        增益名称: '承契_3层',
        增益技能数: 1,
      },
      {
        增益名称: '承契_5层',
        增益技能数: 8,
      },
    ],
  },
  {
    技能名称: '贯穿·3',
    技能数量: 31,
    技能增益列表: [
      {
        增益名称: '承契_5层',
        增益技能数: 31,
      },
    ],
  },
  {
    技能名称: '贯穿·5',
    技能数量: 25,
    技能增益列表: [
      {
        增益名称: '承契_5层',
        增益技能数: 25,
      },
    ],
  },
  {
    技能名称: '贯穿·15',
    技能数量: 13,
    技能增益列表: [
      {
        增益名称: '承契_5层',
        增益技能数: 13,
      },
    ],
  },
  {
    技能名称: '攻击-熊',
    技能数量: 2,
    技能增益列表: [
      {
        增益名称: '承契_5层',
        增益技能数: 2,
      },
    ],
  },
  {
    技能名称: '贯穿·9',
    技能数量: 11,
    技能增益列表: [
      {
        增益名称: '承契_5层',
        增益技能数: 11,
      },
    ],
  },
  {
    技能名称: '攻击-狼',
    技能数量: 6,
    技能增益列表: [
      {
        增益名称: '承契_5层',
        增益技能数: 6,
      },
    ],
  },
  {
    技能名称: '贯穿·12',
    技能数量: 5,
    技能增益列表: [
      {
        增益名称: '承契_5层',
        增益技能数: 5,
      },
    ],
  },
]

export default cycle

export const 循环默认奇穴 = [
  '素矰',
  '棘矢',
  '襄尺',
  '长右',
  '鹿蜀',
  // '诸怀', // '桑柘',
  '桑柘',
  '于狩',
  '卢令',
  '托月',
  '佩弦',
  '贯侯',
  '朱厌',
]
