import { CycleDTO } from '../../@types/cycle'

const cycle: CycleDTO[] = [
  {
    技能名称: '破',
    技能数量: 168,
    技能增益列表: [
      {
        增益名称: '承契_1层',
        增益技能数: 4,
      },
      {
        增益名称: '承契_3层',
        增益技能数: 1,
      },
      {
        增益名称: '承契_5层',
        增益技能数: 162,
      },
    ],
  },
  {
    技能名称: '饮羽簇',
    技能数量: 84,
    技能增益列表: [
      {
        增益名称: '承契_1层',
        增益技能数: 3,
      },
      {
        增益名称: '承契_5层',
        增益技能数: 80,
      },
    ],
  },
  {
    技能名称: '风矢',
    技能数量: 122,
    技能增益列表: [
      {
        增益名称: '承契_1层',
        增益技能数: 4,
      },
      {
        增益名称: '承契_5层',
        增益技能数: 118,
      },
    ],
  },
  {
    技能名称: '贯穿·1',
    技能数量: 15,
    技能增益列表: [
      {
        增益名称: '承契_1层',
        增益技能数: 2,
      },
      {
        增益名称: '承契_5层',
        增益技能数: 13,
      },
    ],
  },
  {
    技能名称: '贯穿·2',
    技能数量: 5,
    技能增益列表: [
      {
        增益名称: '承契_1层',
        增益技能数: 1,
      },
      {
        增益名称: '承契_5层',
        增益技能数: 4,
      },
    ],
  },
  {
    技能名称: '贯穿·4',
    技能数量: 17,
    技能增益列表: [
      {
        增益名称: '承契_1层',
        增益技能数: 5,
      },
      {
        增益名称: '承契_5层',
        增益技能数: 12,
      },
    ],
  },
  {
    技能名称: '攻击-虎',
    技能数量: 4,
    技能增益列表: [
      {
        增益名称: '承契_1层',
        增益技能数: 1,
      },
      {
        增益名称: '承契_5层',
        增益技能数: 3,
      },
    ],
  },
  {
    技能名称: '攻击-鹰',
    技能数量: 3,
    技能增益列表: [
      {
        增益名称: '承契_1层',
        增益技能数: 1,
      },
      {
        增益名称: '承契_5层',
        增益技能数: 2,
      },
    ],
  },
  {
    技能名称: '重击',
    技能数量: 3,
    技能增益列表: [
      {
        增益名称: '承契_1层',
        增益技能数: 1,
      },
      {
        增益名称: '承契_5层',
        增益技能数: 2,
      },
    ],
  },
  {
    技能名称: '践踏',
    技能数量: 3,
    技能增益列表: [
      {
        增益名称: '承契_1层',
        增益技能数: 1,
      },
      {
        增益名称: '承契_5层',
        增益技能数: 2,
      },
    ],
  },
  {
    技能名称: '劲风簇',
    技能数量: 84,
    技能增益列表: [
      {
        增益名称: '承契_1层',
        增益技能数: 1,
      },
      {
        增益名称: '承契_3层',
        增益技能数: 1,
      },
      {
        增益名称: '承契_5层',
        增益技能数: 82,
      },
    ],
  },
  {
    技能名称: '标鹄',
    技能数量: 55,
    技能增益列表: [
      {
        增益名称: '承契_1层,贯侯',
        增益技能数: 1,
      },
      {
        增益名称: '承契_5层,贯侯',
        增益技能数: 54,
      },
    ],
  },
  {
    技能名称: '贯穿·6',
    技能数量: 268,
    技能增益列表: [
      {
        增益名称: '承契_1层',
        增益技能数: 2,
      },
      {
        增益名称: '承契_3层',
        增益技能数: 1,
      },
      {
        增益名称: '承契_5层',
        增益技能数: 265,
      },
    ],
  },
  {
    技能名称: '贯穿·12',
    技能数量: 13,
    技能增益列表: [
      {
        增益名称: '承契_5层',
        增益技能数: 13,
      },
    ],
  },
  {
    技能名称: '贯穿·5',
    技能数量: 36,
    技能增益列表: [
      {
        增益名称: '承契_5层',
        增益技能数: 36,
      },
    ],
  },
  {
    技能名称: '贯穿·15',
    技能数量: 16,
    技能增益列表: [
      {
        增益名称: '承契_5层',
        增益技能数: 16,
      },
    ],
  },
  {
    技能名称: '贯穿·3',
    技能数量: 5,
    技能增益列表: [
      {
        增益名称: '承契_5层',
        增益技能数: 5,
      },
    ],
  },
  {
    技能名称: '攻击-熊',
    技能数量: 3,
    技能增益列表: [
      {
        增益名称: '承契_5层',
        增益技能数: 3,
      },
    ],
  },
  {
    技能名称: '攻击-狼',
    技能数量: 9,
    技能增益列表: [
      {
        增益名称: '承契_5层',
        增益技能数: 9,
      },
    ],
  },
]

export default cycle
