import { CycleDTO } from '../../@types/cycle'

const cycle: CycleDTO[] = [
  {
    技能名称: '标鹄',
    技能数量: 52,
  },
  {
    技能名称: '饮雨簇',
    技能数量: 84,
  },
  {
    技能名称: '劲风簇',
    技能数量: 86,
  },
  {
    技能名称: '破',
    技能数量: 165,
  },
  {
    技能名称: '贯穿(DOT)·六·引爆',
    技能数量: 20,
  },
  {
    技能名称: '贯穿(DOT)·六',
    技能数量: 277,
  },
  {
    技能名称: '贯穿(DOT)·五',
    技能数量: 0,
  },
  {
    技能名称: '贯穿(DOT)·四',
    技能数量: 0,
  },
  {
    技能名称: '贯穿(DOT)·三',
    技能数量: 0,
  },
  {
    技能名称: '贯穿(DOT)·二',
    技能数量: 2,
  },
  {
    技能名称: '贯穿(DOT)·一',
    技能数量: 2,
  },
  {
    技能名称: '风矢',
    技能数量: 121,
  },
  {
    技能名称: '攻击-虎',
    技能数量: 1,
  },
  {
    技能名称: '攻击-狼',
    技能数量: 3,
  },
  {
    技能名称: '攻击-鹰',
    技能数量: 3,
  },
  {
    技能名称: '攻击-野猪',
    技能数量: 2,
  },
  {
    技能名称: '践踏',
    技能数量: 2,
  },
]

export default cycle

export const 循环默认奇穴 = [
  '素矰',
  '棘矢',
  '襄尺',
  '长右',
  '鹿蜀',
  // '诸怀', // '桑柘',
  '桑柘',
  '于狩',
  '卢令',
  '托月',
  '佩弦',
  '贯侯',
  '朱厌',
]
