import commonGainDTO from '@/data/skillGain/common'
import { SkillBasicDTO } from '@/@types/skill'
import guyingshiGainDTO from './skillGain/guyingshi'
import fenjiaoGainDTO from './skillGain/fenjiaoshi'
import liukeyuGainDTO from './skillGain/liukeyu'
import jidianshiGainDTO from './skillGain/jidianshi'
import qiluoshiGainDTO from './skillGain/qiluoshi'
import bishijixuGainDTO from './skillGain/bishijixu'
import { GainDpsTypeEnum, GainTypeEnum } from '@/@types/enum'

const WanlingSkillDataDTO: SkillBasicDTO[] = [
  {
    技能名称: '劲风簇',
    技能伤害系数: 1.2656,
    技能基础伤害_最小值: 180,
    技能基础伤害_最大值: 195,
    武器伤害系数: 1, // !描述1.5 实测1
    伤害计算次数: 1,
    技能增益列表: fenjiaoGainDTO,
  },
  {
    技能名称: '驰风鸣角',
    技能伤害系数: 2.25 * 0.9,
    技能基础伤害_最小值: 405,
    技能基础伤害_最大值: 420,
    武器伤害系数: 2.5,
    伤害计算次数: 1,
    技能增益列表: guyingshiGainDTO,
  },
  {
    技能名称: '霖急簇',
    技能伤害系数: 1.25,
    技能基础伤害_最小值: 165,
    技能基础伤害_最大值: 181,
    武器伤害系数: 1,
    伤害计算次数: 1,
    技能增益列表: liukeyuGainDTO,
  },
  {
    技能名称: '白羽流星',
    技能伤害系数: 0.5,
    技能基础伤害_最小值: 35,
    技能基础伤害_最大值: 40,
    武器伤害系数: 1, // !描述0 实测1
    伤害计算次数: 1,
    技能增益列表: bishijixuGainDTO,
  },
  {
    技能名称: '驰风鸣角',
    技能伤害系数: 1.175,
    技能基础伤害_最小值: 196,
    技能基础伤害_最大值: 202,
    武器伤害系数: 1,
    伤害计算次数: 1,
    技能增益列表: jidianshiGainDTO,
  },
  {
    技能名称: '流矢雨集',
    技能伤害系数: 0.2813,
    技能基础伤害_最小值: 10,
    技能基础伤害_最大值: 15,
    武器伤害系数: 0,
    伤害计算次数: 1,
    技能增益列表: commonGainDTO,
  },
  {
    技能名称: '没石饮羽',
    技能伤害系数: 0.375,
    技能基础伤害_最小值: 10,
    技能基础伤害_最大值: 15,
    武器伤害系数: 0,
    伤害计算次数: 1,
    技能增益列表: commonGainDTO,
  },
  {
    技能名称: '金乌见坠',
    技能伤害系数: 2.374982461 * 0.9,
    技能基础伤害_最小值: 172,
    技能基础伤害_最大值: 194,
    武器伤害系数: 2.5,
    伤害计算次数: 1,
    技能增益列表: qiluoshiGainDTO,
  },
  {
    技能名称: '云刀',
    技能伤害系数: 0.1,
    技能基础伤害_最小值: 0,
    技能基础伤害_最大值: 0,
    武器伤害系数: 1,
    伤害计算次数: 1,
    技能增益列表: commonGainDTO,
  },
  {
    技能名称: '标鹄',
    技能伤害系数: 0.21215,
    技能基础伤害_最小值: 0,
    技能基础伤害_最大值: 0,
    武器伤害系数: 0,
    伤害计算次数: 1,
    技能增益列表: commonGainDTO,
  },
  {
    技能名称: '贯穿·一',
    技能伤害系数: 0.21215,
    技能基础伤害_最小值: 0,
    技能基础伤害_最大值: 0,
    武器伤害系数: 0,
    伤害计算次数: 1,
    技能增益列表: commonGainDTO,
  },
  {
    技能名称: '贯穿·二',
    技能伤害系数: 0.21215,
    技能基础伤害_最小值: 0,
    技能基础伤害_最大值: 0,
    武器伤害系数: 0,
    伤害计算次数: 2,
    技能增益列表: commonGainDTO,
  },
  {
    技能名称: '贯穿·三',
    技能伤害系数: 0.21215,
    技能基础伤害_最小值: 0,
    技能基础伤害_最大值: 0,
    武器伤害系数: 0,
    伤害计算次数: 3,
    技能增益列表: commonGainDTO,
  },
  {
    技能名称: '贯穿·四',
    技能伤害系数: 0.21215,
    技能基础伤害_最小值: 0,
    技能基础伤害_最大值: 0,
    武器伤害系数: 0,
    伤害计算次数: 4,
    技能增益列表: commonGainDTO,
  },
  {
    技能名称: '贯穿·五',
    技能伤害系数: 0.21215,
    技能基础伤害_最小值: 0,
    技能基础伤害_最大值: 0,
    武器伤害系数: 0,
    伤害计算次数: 5,
    技能增益列表: commonGainDTO,
  },
  {
    技能名称: '贯穿·六',
    技能伤害系数: 0.21215,
    技能基础伤害_最小值: 0,
    技能基础伤害_最大值: 0,
    武器伤害系数: 0,
    伤害计算次数: 6,
    技能增益列表: commonGainDTO,
  },
  {
    技能名称: '破',
    // 技能伤害系数: 13.1925 * 0.48 * 1.05, // 修改过一次 原来没有1.05
    技能伤害系数: 13.1925 * 0.15, // 修改过一次 原来没有1.05
    技能基础伤害_最小值: 0,
    技能基础伤害_最大值: 0,
    武器伤害系数: 0,
    伤害计算次数: 1,
    技能增益列表: commonGainDTO,
  },
  {
    技能名称: '逐云寒蕊',
    技能伤害系数: 1.274,
    技能基础伤害_最小值: 0,
    技能基础伤害_最大值: 0,
    武器伤害系数: 0,
    伤害计算次数: 1,
    技能增益列表: [
      ...commonGainDTO,
      {
        增益名称: '飘黄',
        增益所在位置: '套装',
        常驻增益: true,
        增益集合: [
          {
            增益类型: GainTypeEnum.郭氏无视防御,
            增益计算类型: GainDpsTypeEnum.B,
            增益数值: 1024,
          },
        ],
      },
    ],
  },
  {
    // 伤腕
    技能名称: '昆吾·弦刃',
    技能伤害系数: 0.57,
    技能基础伤害_最小值: 0,
    技能基础伤害_最大值: 0,
    武器伤害系数: 0,
    伤害计算次数: 1,
    技能增益列表: commonGainDTO,
  },
  {
    // 伤鞋
    技能名称: '刃凌',
    技能伤害系数: 0.57,
    技能基础伤害_最小值: 0,
    技能基础伤害_最大值: 0,
    武器伤害系数: 0,
    伤害计算次数: 1,
    技能增益列表: commonGainDTO,
  },
  {
    // 龙门武器
    技能名称: '剑风',
    技能伤害系数: 0,
    技能基础伤害_最小值: 3040,
    技能基础伤害_最大值: 3040,
    武器伤害系数: 0,
    伤害计算次数: 1,
    技能增益列表: commonGainDTO,
  },
]
export default WanlingSkillDataDTO
